cask_args appdir: "/Applications"

# install packages + some apps
tap "homebrew/bundle"

# apps casks
cask "1password"
cask "affinity-photo"
cask "digikam"
cask "firefox"
cask "ghostty"
cask "google-drive"
cask "iterm2"
cask "jetbrains-toolbox"
cask "slack"
cask "tailscale"
cask "telegram"
cask "tidal"
cask "visual-studio-code"
cask "zoom"

# jdk casks
cask "temurin@17"
cask "temurin@21"

# brews
brew "bat"
brew "fd"
brew "fnm"
brew "fzf"
brew "git"
brew "gradle"
brew "gradle-profiler"
brew "JakeWharton/repo/diffuse"
brew "jj"
brew "jjui"
brew "jenv"
brew "pyenv"
brew "python@3.10"
brew "rbenv"
brew "rust"
brew "scrcpy"
brew "television"
brew "tmux"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
